---
kind: property
id: P:Autodesk.Revit.DB.FamilySymbolFilter.FamilyId
source: html/8dad7be1-1e6e-4080-aca6-f2e738a6f6c1.htm
---
# Autodesk.Revit.DB.FamilySymbolFilter.FamilyId Property

The family id.

## Syntax (C#)
```csharp
public ElementId FamilyId { get; }
```